src/Reports/ОтчётПоННСХарьков/ОтчётПоННСХарьков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоННСХарьков</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/СтатусыНакладныхНаСборку/СтатусыНакладныхНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыНакладныхНаСборку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНакладнойНаСборку</types>
    </type>
  </resources>
  <dimensions>
    <name>НакладнаяНаСборку</name>
    <type>
      <types>DocumentRef.НакладнаяНаСборку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыНакладнойНаСборку/СтатусыНакладнойНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыНакладнойНаСборку</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>НаСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>НаУпаковке</name>
  </enumValues>
  <enumValues>
    <name>Упакован</name>
  </enumValues>
</mdclass:Enum>

src/Documents/НакладнаяНаСборку/НакладнаяНаСборку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НакладнаяНаСборку</name>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДоставки</name>
    <type>
      <types>CatalogRef.КартыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомераТары</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрупныйЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БарКоды</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>БарКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗоныКомплектации</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Тары</name>
    <attributes>
      <name>ЗонаКомплектации</name>
      <type>
        <types>EnumRef.ЗоныКомплектации</types>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ТранспортировочныеТары</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/ОтчётПоННСХарьков/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблННС = Макет.ПолучитьОбласть("ННС");
ОблПродукция = Макет.ПолучитьОбласть("Продукция");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НакладнаяНаСборку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НакладнаяНаСборку КАК НакладнаяНаСборку
	|ГДЕ
	|	НакладнаяНаСборку.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НакладнаяНаСборку.Проведен = ИСТИНА";
	Если Не Автор.Пустая() Тогда
	Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Автор = &Автор";
	Запрос.УстановитьПараметр("Автор", Автор);
	КонецЕсли;
		Если Не Контрагент.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.Контрагент = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		КонецЕсли;
			Если ЛинейкаУпаковки > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ЛинейкаУпаковки = &ЛинейкаУпаковки";
			Запрос.УстановитьПараметр("ЛинейкаУпаковки", ЛинейкаУпаковки);
			КонецЕсли;
				Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
				Запрос.Текст = Запрос.Текст + " И НакладнаяНаСборку.ДатаОтгрузки = &ДатаОтгрузки";
				Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
				КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО НакладнаяНаСборку.Дата";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
КоличествоВсего = 0;
КоличествоНаСборке = 0;
КоличествоСобрано = 0;
КоличествоНаУпаковке = 0;
КоличествоУпаковано = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ННС = ВыборкаДетальныеЗаписи.Ссылка;
	ИсполнительННС = ННС.ТабличнаяЧасть[0].Исполнитель;
		Если Не Исполнитель.Пустая() Тогда
			Если ИсполнительННС <> Исполнитель Тогда
			Продолжить;
			КонецЕсли;	
		КонецЕсли; 
	ОблННС.Параметры.Номер = ННС.Номер;
	ОблННС.Параметры.Дата = ННС.Дата;
	ОблННС.Параметры.ННС = ННС;
	ОблННС.Параметры.ЛинейкаУпаковки = ННС.ЛинейкаУпаковки;
	ОблННС.Параметры.НомераТары = ННС.НомераТары;
	ОблННС.Параметры.Клиент = ННС.Контрагент;
	ОблННС.Параметры.КартаДоставки = ННС.КартаДоставки;
	ОблННС.Параметры.Исполнитель = ИсполнительННС;
	ОблННС.Параметры.Автор = ННС.Автор;
	Количество = 0;
		Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл
		Количество = Количество + ТЧ.Количество;
		КонецЦикла; 
	ОблННС.Параметры.Количество = Количество;
	ДатаСоздан = ННС.Дата;
    ДатаНаСборке = "";
    ДатаСобран = "";
    ДатаНаУпаковке = "";
    ДатаУпакован = "";
	НаборЗаписей = РегистрыСведений.СтатусыНакладныхНаСборку.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НакладнаяНаСборку.Установить(ННС);
	НаборЗаписей.Прочитать();
	    Для Каждого Запись Из НаборЗаписей Цикл
        	Если Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Создан Тогда
			ДатаСоздан = Запись.Период;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.НаСборке Тогда
			ДатаНаСборке = Запись.Период;
			КоличествоНаСборке = КоличествоНаСборке + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Собран Тогда
			ДатаСобран = Запись.Период;
			КоличествоСобрано = КоличествоСобрано + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.НаУпаковке Тогда
			ДатаНаУпаковке = Запись.Период;
			КоличествоНаУпаковке = КоличествоНаУпаковке + Количество;
        	ИначеЕсли Запись.Статус = Перечисления.СтатусыНакладнойНаСборку.Упакован Тогда
			ДатаУпакован = Запись.Период;					
			КоличествоУпаковано = КоличествоУпаковано + Количество;
			КонецЕсли; 
		КонецЦикла;
	ОблННС.Параметры.ДатаСоздан = ДатаСоздан;
	ОблННС.Параметры.ДатаНаСборке = ДатаНаСборке;
	ОблННС.Параметры.ДатаСобран = ДатаСобран;
	ОблННС.Параметры.ДатаНаУпаковке = ДатаНаУпаковке;
	ОблННС.Параметры.ДатаУпакован = ДатаУпакован;
	ТабДок.Вывести(ОблННС);
	КоличествоВсего = КоличествоВсего + Количество;
		Если Расшифровать Тогда	
		ТабДок.НачатьГруппуСтрок(ННС,Истина);
			Для каждого ТЧ Из ННС.ТабличнаяЧасть Цикл
			ОблПродукция.Параметры.Продукция = ТЧ.Продукция;
			ОблПродукция.Параметры.Количество = ТЧ.Количество;
			ОблПродукция.Параметры.Исполнитель = ТЧ.Исполнитель;		
			ТабДок.Вывести(ОблПродукция);
			КонецЦикла; 
		ТабДок.ЗакончитьГруппуСтрок();
		КонецЕсли; 
	КонецЦикла;
ОблКонец.Параметры.Количество = КоличествоВсего;
ОблКонец.Параметры.КоличествоНаСборке = КоличествоНаСборке; 
ОблКонец.Параметры.КоличествоСобрано = КоличествоСобрано;
ОблКонец.Параметры.КоличествоНаУпаковке = КоличествоНаУпаковке;
ОблКонец.Параметры.КоличествоУпаковано = КоличествоУпаковано;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
